week06/lab6.org
#+title: Lab 6 Amirlan Sharipov (BS-CS21-01)
#+author: Amirlan Sharipov (BS-CS21-01)

* Exercise 1
** Table creation and insertion
I used the schema provided in the slides. And then manually inserted data into the tables.

#+begin_src sql
CREATE TABLE customers (
    customerId INT,
    customerName VARCHAR(50),
    city VARCHAR(50),
    PRIMARY KEY (customerId)
);

CREATE TABLE items (
    itemId INT,
    itemName VARCHAR(50),
    price FLOAT,
    PRIMARY KEY (itemId)
);

CREATE TABLE orders (
    orderId INT,
    customerId INT,
    date DATE,
    FOREIGN KEY (customerId) REFERENCES customers(customerId),
    PRIMARY KEY (orderId)
);

CREATE TABLE order_details (
    orderId INT,
    itemId INT,
    quantity INT,
    FOREIGN KEY (itemId) REFERENCES items(itemId),
    PRIMARY KEY (orderId, itemId)
);

INSERT INTO customers VALUES('101', 'Martin', 'Prague');
INSERT INTO customers VALUES('107', 'Herman', 'Madrid');
INSERT INTO customers VALUES('110', 'Pedro', 'Moscow');

INSERT INTO items VALUES('3786', 'Net', 35.0);
INSERT INTO items VALUES('4011', 'Racket', 65.0);
INSERT INTO items VALUES('9132', 'Pack-3', 4.75);
INSERT INTO items VALUES('5794', 'Pack-6', 5.0);
INSERT INTO items VALUES('3141', 'Cover', 10.0);

INSERT INTO orders VALUES('2301', '101', '2011-02-23');
INSERT INTO orders VALUES('2302', '107', '2011-02-25');
INSERT INTO orders VALUES('2303', '110', '2011-02-27');

INSERT INTO order_details VALUES ('2301', '3786', 3);
INSERT INTO order_details VALUES ('2301', '4011', 6);
INSERT INTO order_details VALUES ('2301', '9132', 8);
INSERT INTO order_details VALUES ('2302', '5794', 4);
INSERT INTO order_details VALUES ('2303', '4011', 2);
INSERT INTO order_details VALUES ('2303', '3141', 2);
#+end_src

