week06/lab6.org
** Queries
First query takes the sum of all prices * quantities groupped by the orders and sorts them.
The second query does the same thing, groups by customers, sorts by sum of quantities (descending order) and takes the first result.
#+begin_src sql
SELECT order_details.orderId, SUM(items.price * order_details.quantity)
FROM order_details
INNER JOIN items on items.itemId=order_details.itemId
group by order_details.orderId ORDER BY sum ASC;

SELECT customers.customerName, customers.city FROM customers
INNER JOIN orders ON customers.customerId=orders.customerId
INNER JOIN order_details ON order_details.orderId=orders.orderId
GROUP BY customers.customerId
ORDER BY SUM(order_details.quantity) DESC
LIMIT 1;
#+end_src

* Exercise 2
** Normalization
I have several assumptions:
- Any teacher can work at several schools at once (or change the school)
- Room numbers don't depend on schools: the first number of the room name is not enough to assume the opposite
- Teachers may teach several courses: it's an elementary school, usually teachers can teach anything in elementary schools

*** 1NF
It's almost in 1NF state. Each cell is already atomic, values of the same domain, etc. The only thing that's not there is the primary key. Let's say for now that the primary key is a tuple of school, teacher, course, room, grade, and book. This way there are no conflicts. It still looks like a mess, so I will normalize it further.
*** 2NF
Make new tables with relations for partial functional dependencies of non-prime attributes on candidate keys:
- lessons (lessonId, schoolName, teacherName, courseName, roomName, gradeName)
- books (bookId, bookName, publisherName)
- loans (loanId, lessonId, bookId, loanDate)
*** 3NF
Make new tables (with appropriate IDs) with relations for transitive functional dependencies of non-prime attribute on candidate key:
- schools (schoolId, schoolName)
- teachers (teacherId, teacherName)
- courses (courseId, courseName)
- rooms (roomId, roomName)
- grades (gradeId, gradeName)
- publishers (publisherId, publisherName)
- lessons (lessonId, schoolId, teacherId, courseId, roomId, gradeId)
- books (bookId, bookName, publisherId)
- loans (loanId, lessonId, bookId, loanDate)
*** BCNF and 4NF
Already satisfies.

