week06/lab6.html

<div id="outline-container-org4bc389b" class="outline-3">
<h3 id="org4bc389b"><span class="section-number-3">2.2.</span> Queries</h3>
<div class="outline-text-3" id="text-2-2">
<p>
First query takes the sum of all prices * quantities groupped by the orders and sorts them.
The second query does the same thing, groups by customers, sorts by sum of quantities (descending order) and takes the first result.
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #89DDFF;">SELECT</span> order_details.orderId, <span style="color: #82aaff;">SUM</span>(items.price * order_details.quantity)
<span style="color: #89DDFF;">FROM</span> order_details
<span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> items <span style="color: #89DDFF;">on</span> items.itemId=order_details.itemId
<span style="color: #89DDFF;">group</span> <span style="color: #89DDFF;">by</span> order_details.orderId <span style="color: #89DDFF;">ORDER</span> <span style="color: #89DDFF;">BY</span> <span style="color: #82aaff;">sum</span> <span style="color: #89DDFF;">ASC</span>;

<span style="color: #89DDFF;">SELECT</span> customers.customerName, customers.city <span style="color: #89DDFF;">FROM</span> customers
<span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> orders <span style="color: #89DDFF;">ON</span> customers.customerId=orders.customerId
<span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> order_details <span style="color: #89DDFF;">ON</span> order_details.orderId=orders.orderId
<span style="color: #89DDFF;">GROUP</span> <span style="color: #89DDFF;">BY</span> customers.customerId
<span style="color: #89DDFF;">ORDER</span> <span style="color: #89DDFF;">BY</span> <span style="color: #82aaff;">SUM</span>(order_details.quantity) <span style="color: #89DDFF;">DESC</span>
<span style="color: #89DDFF;">LIMIT</span> <span style="color: #f78c6c; font-weight: bold;">1</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org613a69d" class="outline-2">
<h2 id="org613a69d"><span class="section-number-2">3.</span> Exercise 2</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd2fe10b" class="outline-3">
<h3 id="orgd2fe10b"><span class="section-number-3">3.1.</span> Normalization</h3>
<div class="outline-text-3" id="text-3-1">
<p>
I have several assumptions:
</p>
<ul class="org-ul">
<li>Any teacher can work at several schools at once (or change the school)</li>
<li>Room numbers don&rsquo;t depend on schools: the first number of the room name is not enough to assume the opposite</li>
<li>Teachers may teach several courses: it&rsquo;s an elementary school, usually teachers can teach anything in elementary schools</li>
</ul>
</div>

<div id="outline-container-org3192edb" class="outline-4">
<h4 id="org3192edb"><span class="section-number-4">3.1.1.</span> 1NF</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
It&rsquo;s almost in 1NF state. Each cell is already atomic, values of the same domain, etc. The only thing that&rsquo;s not there is the primary key. Let&rsquo;s say for now that the primary key is a tuple of school, teacher, course, room, grade, and book. This way there are no conflicts. It still looks like a mess, so I will normalize it further.
</p>
</div>
</div>
<div id="outline-container-org7985b8c" class="outline-4">
<h4 id="org7985b8c"><span class="section-number-4">3.1.2.</span> 2NF</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Make new tables with relations for partial functional dependencies of non-prime attributes on candidate keys:
</p>
<ul class="org-ul">
<li>lessons (lessonId, schoolName, teacherName, courseName, roomName, gradeName)</li>
<li>books (bookId, bookName, publisherName)</li>
<li>loans (loanId, lessonId, bookId, loanDate)</li>
</ul>
</div>
</div>
<div id="outline-container-orgcc1c4fe" class="outline-4">
<h4 id="orgcc1c4fe"><span class="section-number-4">3.1.3.</span> 3NF</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Make new tables (with appropriate IDs) with relations for transitive functional dependencies of non-prime attribute on candidate key:
</p>
<ul class="org-ul">
<li>schools (schoolId, schoolName)</li>
<li>teachers (teacherId, teacherName)</li>
<li>courses (courseId, courseName)</li>
<li>rooms (roomId, roomName)</li>
<li>grades (gradeId, gradeName)</li>
<li>publishers (publisherId, publisherName)</li>
<li>lessons (lessonId, schoolId, teacherId, courseId, roomId, gradeId)</li>
<li>books (bookId, bookName, publisherId)</li>
<li>loans (loanId, lessonId, bookId, loanDate)</li>
</ul>
</div>
</div>
<div id="outline-container-org5a0e8c4" class="outline-4">
<h4 id="org5a0e8c4"><span class="section-number-4">3.1.4.</span> BCNF and 4NF</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Already satisfies.
</p>
</div>
</div>
