week06/lab6.tex

\subsection{Queries}
\label{sec:org4f468b3}
First query takes the sum of all prices * quantities groupped by the orders and sorts them.
The second query does the same thing, groups by customers, sorts by sum of quantities (descending order) and takes the first result.
\begin{verbatim}
SELECT order_details.orderId, SUM(items.price * order_details.quantity)
FROM order_details
INNER JOIN items on items.itemId=order_details.itemId
group by order_details.orderId ORDER BY sum ASC;

SELECT customers.customerName, customers.city FROM customers
INNER JOIN orders ON customers.customerId=orders.customerId
INNER JOIN order_details ON order_details.orderId=orders.orderId
GROUP BY customers.customerId
ORDER BY SUM(order_details.quantity) DESC
LIMIT 1;
\end{verbatim}

\section{Exercise 2}
\label{sec:org99a84d3}
\subsection{Normalization}
\label{sec:org77cd4b4}
I have several assumptions:
\begin{itemize}
\item Any teacher can work at several schools at once (or change the school)
\item Room numbers don't depend on schools: the first number of the room name is not enough to assume the opposite
\item Teachers may teach several courses: it's an elementary school, usually teachers can teach anything in elementary schools
\end{itemize}

\subsubsection{1NF}
\label{sec:org4242f0d}
It's almost in 1NF state. Each cell is already atomic, values of the same domain, etc. The only thing that's not there is the primary key. Let's say for now that the primary key is a tuple of school, teacher, course, room, grade, and book. This way there are no conflicts. It still looks like a mess, so I will normalize it further.
\subsubsection{2NF}
\label{sec:orge350be8}
Make new tables with relations for partial functional dependencies of non-prime attributes on candidate keys:
\begin{itemize}
\item lessons (lessonId, schoolName, teacherName, courseName, roomName, gradeName)
\item books (bookId, bookName, publisherName)
\item loans (loanId, lessonId, bookId, loanDate)
\end{itemize}
\subsubsection{3NF}
\label{sec:org627722d}
Make new tables (with appropriate IDs) with relations for transitive functional dependencies of non-prime attribute on candidate key:
\begin{itemize}
\item schools (schoolId, schoolName)
\item teachers (teacherId, teacherName)
\item courses (courseId, courseName)
\item rooms (roomId, roomName)
\item grades (gradeId, gradeName)
\item publishers (publisherId, publisherName)
\item lessons (lessonId, schoolId, teacherId, courseId, roomId, gradeId)
\item books (bookId, bookName, publisherId)
\item loans (loanId, lessonId, bookId, loanDate)
\end{itemize}
\subsubsection{BCNF and 4NF}
\label{sec:org00e5b2a}
Already satisfies.
