week06/lab6.html

<div id="outline-container-org19e9a14" class="outline-4">
<h4 id="org19e9a14"><span class="section-number-4">3.1.5.</span> Code</h4>
<div class="outline-text-4" id="text-3-1-5">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #89DDFF;">CREATE</span> <span style="color: #89DDFF;">TABLE</span> <span style="color: #82aaff;">schools</span> (
    schoolId SERIAL,
    schoolName <span style="color: #c792ea;">VARCHAR</span>(<span style="color: #f78c6c; font-weight: bold;">50</span>),
    <span style="color: #89DDFF;">PRIMARY</span> <span style="color: #89DDFF;">KEY</span> (schoolId)
);

<span style="color: #89DDFF;">CREATE</span> <span style="color: #89DDFF;">TABLE</span> <span style="color: #82aaff;">teachers</span> (
    teacherId SERIAL,
    teacherName <span style="color: #c792ea;">VARCHAR</span>(<span style="color: #f78c6c; font-weight: bold;">30</span>),
    <span style="color: #89DDFF;">PRIMARY</span> <span style="color: #89DDFF;">KEY</span> (teacherId)
);

<span style="color: #89DDFF;">CREATE</span> <span style="color: #89DDFF;">TABLE</span> <span style="color: #82aaff;">courses</span> (
    courseId SERIAL,
    courseName <span style="color: #c792ea;">VARCHAR</span>(<span style="color: #f78c6c; font-weight: bold;">40</span>),
    <span style="color: #89DDFF;">PRIMARY</span> <span style="color: #89DDFF;">KEY</span> (courseId)
);

<span style="color: #89DDFF;">CREATE</span> <span style="color: #89DDFF;">TABLE</span> <span style="color: #82aaff;">rooms</span> (
    roomId SERIAL,
    roomName <span style="color: #c792ea;">VARCHAR</span>(<span style="color: #f78c6c; font-weight: bold;">40</span>),
    <span style="color: #89DDFF;">PRIMARY</span> <span style="color: #89DDFF;">KEY</span> (roomId)
);

<span style="color: #89DDFF;">CREATE</span> <span style="color: #89DDFF;">TABLE</span> <span style="color: #82aaff;">grades</span> (
    gradeId SERIAL,
    gradeName <span style="color: #c792ea;">VARCHAR</span>(<span style="color: #f78c6c; font-weight: bold;">15</span>),
    <span style="color: #89DDFF;">PRIMARY</span> <span style="color: #89DDFF;">KEY</span> (gradeId)
);

<span style="color: #89DDFF;">CREATE</span> <span style="color: #89DDFF;">TABLE</span> <span style="color: #82aaff;">publishers</span> (
    publisherId SERIAL,
    publisherName <span style="color: #c792ea;">VARCHAR</span>(<span style="color: #f78c6c; font-weight: bold;">30</span>),
    <span style="color: #89DDFF;">PRIMARY</span> <span style="color: #89DDFF;">KEY</span> (publisherId)
);

<span style="color: #89DDFF;">CREATE</span> <span style="color: #89DDFF;">TABLE</span> <span style="color: #82aaff;">books</span> (
    bookId SERIAL,
    bookName <span style="color: #c792ea;">VARCHAR</span>(<span style="color: #f78c6c; font-weight: bold;">60</span>),
    publisherId <span style="color: #c792ea;">INT</span>,
    <span style="color: #89DDFF;">FOREIGN</span> <span style="color: #89DDFF;">KEY</span> (publisherId) <span style="color: #89DDFF;">REFERENCES</span> publishers(publisherId),
    <span style="color: #89DDFF;">PRIMARY</span> <span style="color: #89DDFF;">KEY</span> (bookId)
);

<span style="color: #89DDFF;">CREATE</span> <span style="color: #89DDFF;">TABLE</span> <span style="color: #82aaff;">lessons</span> (
    lessonId SERIAL,
    schoolId <span style="color: #c792ea;">INT</span>,
    teacherId <span style="color: #c792ea;">INT</span>,
    courseId <span style="color: #c792ea;">INT</span>,
    roomId <span style="color: #c792ea;">INT</span>,
    gradeId <span style="color: #c792ea;">INT</span>,
    <span style="color: #89DDFF;">FOREIGN</span> <span style="color: #89DDFF;">KEY</span> (teacherId) <span style="color: #89DDFF;">REFERENCES</span> teachers(teacherId),
    <span style="color: #89DDFF;">FOREIGN</span> <span style="color: #89DDFF;">KEY</span> (courseId) <span style="color: #89DDFF;">REFERENCES</span> courses(courseId),
    <span style="color: #89DDFF;">FOREIGN</span> <span style="color: #89DDFF;">KEY</span> (roomId) <span style="color: #89DDFF;">REFERENCES</span> rooms(roomId),
    <span style="color: #89DDFF;">FOREIGN</span> <span style="color: #89DDFF;">KEY</span> (gradeId) <span style="color: #89DDFF;">REFERENCES</span> grades(gradeId),
    <span style="color: #89DDFF;">PRIMARY</span> <span style="color: #89DDFF;">KEY</span> (lessonId)
);

<span style="color: #89DDFF;">CREATE</span> <span style="color: #89DDFF;">TABLE</span> <span style="color: #82aaff;">loans</span> (
    loanId SERIAL,
    lessonId <span style="color: #c792ea;">INT</span>,
    bookId <span style="color: #c792ea;">INT</span>,
    loanDate <span style="color: #c792ea;">DATE</span>,
    <span style="color: #89DDFF;">FOREIGN</span> <span style="color: #89DDFF;">KEY</span> (lessonId) <span style="color: #89DDFF;">REFERENCES</span> lessons(lessonId),
    <span style="color: #89DDFF;">FOREIGN</span> <span style="color: #89DDFF;">KEY</span> (bookId) <span style="color: #89DDFF;">REFERENCES</span> books(bookId),
    <span style="color: #89DDFF;">PRIMARY</span> <span style="color: #89DDFF;">KEY</span> (loanId)
);

<span style="color: #89DDFF;">INSERT</span> <span style="color: #89DDFF;">INTO</span> schools (schoolName)
    <span style="color: #89DDFF;">SELECT</span> <span style="color: #89DDFF;">DISTINCT</span> school <span style="color: #89DDFF;">FROM</span> loan_books;
<span style="color: #89DDFF;">INSERT</span> <span style="color: #89DDFF;">INTO</span> teachers (teacherName)
    <span style="color: #89DDFF;">SELECT</span> <span style="color: #89DDFF;">DISTINCT</span> teacher <span style="color: #89DDFF;">FROM</span> loan_books;
<span style="color: #676E95;">-- </span><span style="color: #676E95;">Inserted Numerical thinking 2 times because of case sensitivity. Not gonna change anything.</span>
<span style="color: #89DDFF;">INSERT</span> <span style="color: #89DDFF;">INTO</span> courses (courseName)
    <span style="color: #89DDFF;">SELECT</span> <span style="color: #89DDFF;">DISTINCT</span> course <span style="color: #89DDFF;">FROM</span> loan_books;
<span style="color: #89DDFF;">INSERT</span> <span style="color: #89DDFF;">INTO</span> rooms (roomName)
    <span style="color: #89DDFF;">SELECT</span> <span style="color: #89DDFF;">DISTINCT</span> room <span style="color: #89DDFF;">FROM</span> loan_books;
<span style="color: #89DDFF;">INSERT</span> <span style="color: #89DDFF;">INTO</span> grades (gradeName)
    <span style="color: #89DDFF;">SELECT</span> <span style="color: #89DDFF;">DISTINCT</span> grade <span style="color: #89DDFF;">FROM</span> loan_books;
<span style="color: #89DDFF;">INSERT</span> <span style="color: #89DDFF;">INTO</span> publishers (publisherName)
    <span style="color: #89DDFF;">SELECT</span> <span style="color: #89DDFF;">DISTINCT</span> publisher <span style="color: #89DDFF;">FROM</span> loan_books;
<span style="color: #89DDFF;">INSERT</span> <span style="color: #89DDFF;">INTO</span> books (bookName, publisherId)
    <span style="color: #89DDFF;">SELECT</span> <span style="color: #89DDFF;">DISTINCT</span> loan_books.book,
    publishers.publisherId <span style="color: #89DDFF;">FROM</span> loan_books
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> publishers <span style="color: #89DDFF;">ON</span>
        publishers.publisherName=loan_books.publisher;

<span style="color: #89DDFF;">INSERT</span> <span style="color: #89DDFF;">INTO</span> lessons (schoolId, teacherId, courseId, roomId, gradeId)
    <span style="color: #89DDFF;">SELECT</span> <span style="color: #89DDFF;">DISTINCT</span> schools.schoolId, teachers.teacherId,
        courses.courseId, rooms.roomId, grades.gradeId <span style="color: #89DDFF;">FROM</span> loan_books
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> schools <span style="color: #89DDFF;">ON</span> schools.schoolName=loan_books.school
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> teachers <span style="color: #89DDFF;">ON</span> teachers.teacherName=loan_books.teacher
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> courses <span style="color: #89DDFF;">ON</span> courses.courseName=loan_books.course
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> rooms <span style="color: #89DDFF;">ON</span> rooms.roomName=loan_books.room
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> grades <span style="color: #89DDFF;">ON</span> grades.gradeName=loan_books.grade;

<span style="color: #89DDFF;">INSERT</span> <span style="color: #89DDFF;">INTO</span> loans (lessonId, bookId, loanDate)
    <span style="color: #89DDFF;">SELECT</span> <span style="color: #89DDFF;">DISTINCT</span> lessons.lessonId, books.bookId,
        loan_books.loanDate <span style="color: #89DDFF;">FROM</span> loan_books
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> schools <span style="color: #89DDFF;">ON</span> schools.schoolName=loan_books.school
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> teachers <span style="color: #89DDFF;">ON</span> teachers.teacherName=loan_books.teacher
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> courses <span style="color: #89DDFF;">ON</span> courses.courseName=loan_books.course
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> rooms <span style="color: #89DDFF;">ON</span> rooms.roomName=loan_books.room
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> grades <span style="color: #89DDFF;">ON</span> grades.gradeName=loan_books.grade
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> books <span style="color: #89DDFF;">ON</span> books.bookName=loan_books.book
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> lessons <span style="color: #89DDFF;">ON</span> lessons.gradeId=grades.gradeId
        <span style="color: #89DDFF;">and</span> lessons.roomId=rooms.roomId
        <span style="color: #89DDFF;">and</span> lessons.courseId=courses.courseId
        <span style="color: #89DDFF;">and</span> lessons.teacherId=teachers.teacherId;
</pre>
</div>
</div>
</div>
</div>
