week06/lab6.tex

\subsubsection{Code}
\label{sec:org3de05cf}
\begin{verbatim}
CREATE TABLE schools (
    schoolId SERIAL,
    schoolName VARCHAR(50),
    PRIMARY KEY (schoolId)
);

CREATE TABLE teachers (
    teacherId SERIAL,
    teacherName VARCHAR(30),
    PRIMARY KEY (teacherId)
);

CREATE TABLE courses (
    courseId SERIAL,
    courseName VARCHAR(40),
    PRIMARY KEY (courseId)
);

CREATE TABLE rooms (
    roomId SERIAL,
    roomName VARCHAR(40),
    PRIMARY KEY (roomId)
);

CREATE TABLE grades (
    gradeId SERIAL,
    gradeName VARCHAR(15),
    PRIMARY KEY (gradeId)
);

CREATE TABLE publishers (
    publisherId SERIAL,
    publisherName VARCHAR(30),
    PRIMARY KEY (publisherId)
);

CREATE TABLE books (
    bookId SERIAL,
    bookName VARCHAR(60),
    publisherId INT,
    FOREIGN KEY (publisherId) REFERENCES publishers(publisherId),
    PRIMARY KEY (bookId)
);

CREATE TABLE lessons (
    lessonId SERIAL,
    schoolId INT,
    teacherId INT,
    courseId INT,
    roomId INT,
    gradeId INT,
    FOREIGN KEY (teacherId) REFERENCES teachers(teacherId),
    FOREIGN KEY (courseId) REFERENCES courses(courseId),
    FOREIGN KEY (roomId) REFERENCES rooms(roomId),
    FOREIGN KEY (gradeId) REFERENCES grades(gradeId),
    PRIMARY KEY (lessonId)
);

CREATE TABLE loans (
    loanId SERIAL,
    lessonId INT,
    bookId INT,
    loanDate DATE,
    FOREIGN KEY (lessonId) REFERENCES lessons(lessonId),
    FOREIGN KEY (bookId) REFERENCES books(bookId),
    PRIMARY KEY (loanId)
);

INSERT INTO schools (schoolName)
    SELECT DISTINCT school FROM loan_books;
INSERT INTO teachers (teacherName)
    SELECT DISTINCT teacher FROM loan_books;
-- Inserted Numerical thinking 2 times because of case sensitivity. Not gonna change anything.
INSERT INTO courses (courseName)
    SELECT DISTINCT course FROM loan_books;
INSERT INTO rooms (roomName)
    SELECT DISTINCT room FROM loan_books;
INSERT INTO grades (gradeName)
    SELECT DISTINCT grade FROM loan_books;
INSERT INTO publishers (publisherName)
    SELECT DISTINCT publisher FROM loan_books;
INSERT INTO books (bookName, publisherId)
    SELECT DISTINCT loan_books.book,
    publishers.publisherId FROM loan_books
    INNER JOIN publishers ON
        publishers.publisherName=loan_books.publisher;

INSERT INTO lessons (schoolId, teacherId, courseId, roomId, gradeId)
    SELECT DISTINCT schools.schoolId, teachers.teacherId,
        courses.courseId, rooms.roomId, grades.gradeId FROM loan_books
    INNER JOIN schools ON schools.schoolName=loan_books.school
    INNER JOIN teachers ON teachers.teacherName=loan_books.teacher
    INNER JOIN courses ON courses.courseName=loan_books.course
    INNER JOIN rooms ON rooms.roomName=loan_books.room
    INNER JOIN grades ON grades.gradeName=loan_books.grade;

INSERT INTO loans (lessonId, bookId, loanDate)
    SELECT DISTINCT lessons.lessonId, books.bookId,
        loan_books.loanDate FROM loan_books
    INNER JOIN schools ON schools.schoolName=loan_books.school
    INNER JOIN teachers ON teachers.teacherName=loan_books.teacher
    INNER JOIN courses ON courses.courseName=loan_books.course
    INNER JOIN rooms ON rooms.roomName=loan_books.room
    INNER JOIN grades ON grades.gradeName=loan_books.grade
    INNER JOIN books ON books.bookName=loan_books.book
    INNER JOIN lessons ON lessons.gradeId=grades.gradeId
        and lessons.roomId=rooms.roomId
        and lessons.courseId=courses.courseId
        and lessons.teacherId=teachers.teacherId;
\end{verbatim}
