week06/lab6.html
<div id="outline-container-org7829592" class="outline-3">
<h3 id="org7829592"><span class="section-number-3">3.2.</span> Queries</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The first query list all the schools that borrowed the books of every publisher using DISTINCT keyword.
The second query orders the results from each school, and takes only 1 loan that has the highest loanDate for each school.
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #89DDFF;">SELECT</span> <span style="color: #89DDFF;">DISTINCT</span> publishers.publisherName, books.bookName,
    schools.schoolName <span style="color: #89DDFF;">FROM</span> books
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> loans <span style="color: #89DDFF;">ON</span> loans.bookId=books.bookId
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> lessons <span style="color: #89DDFF;">ON</span> lessons.lessonId=loans.lessonId
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> schools <span style="color: #89DDFF;">ON</span> schools.schoolId=lessons.schoolId
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> publishers <span style="color: #89DDFF;">ON</span> publishers.publisherId=books.publisherId
    <span style="color: #89DDFF;">ORDER</span> <span style="color: #89DDFF;">BY</span> publishers.publisherName;

<span style="color: #89DDFF;">SELECT</span> <span style="color: #89DDFF;">DISTINCT</span> <span style="color: #89DDFF;">ON</span> (schools.schoolName) schools.schoolName,
    publishers.publisherName, books.bookName <span style="color: #89DDFF;">FROM</span> loans
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> lessons <span style="color: #89DDFF;">ON</span> lessons.lessonId=loans.lessonId
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> schools <span style="color: #89DDFF;">ON</span> schools.schoolId=lessons.schoolId
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> books <span style="color: #89DDFF;">ON</span> books.bookId=loans.bookId
    <span style="color: #89DDFF;">INNER</span> <span style="color: #89DDFF;">JOIN</span> publishers <span style="color: #89DDFF;">ON</span> publishers.publisherId=books.publisherId
    <span style="color: #89DDFF;">ORDER</span> <span style="color: #89DDFF;">BY</span> schools.schoolName, loans.loanDate <span style="color: #89DDFF;">DESC</span>, <span style="color: #f78c6c; font-weight: bold;">1</span>;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Amirlan Sharipov (BS-CS21-01)</p>
<p class="date">Created: 2023-02-28 Tue 23:48</p>
</div>
</body>
</html>