week06/lab6.tex
\subsection{Queries}
\label{sec:org917674e}
The first query list all the schools that borrowed the books of every publisher using DISTINCT keyword.
The second query orders the results from each school, and takes only 1 loan that has the highest loanDate for each school.
\begin{verbatim}
SELECT DISTINCT publishers.publisherName, books.bookName,
    schools.schoolName FROM books
    INNER JOIN loans ON loans.bookId=books.bookId
    INNER JOIN lessons ON lessons.lessonId=loans.lessonId
    INNER JOIN schools ON schools.schoolId=lessons.schoolId
    INNER JOIN publishers ON publishers.publisherId=books.publisherId
    ORDER BY publishers.publisherName;

SELECT DISTINCT ON (schools.schoolName) schools.schoolName,
    publishers.publisherName, books.bookName FROM loans
    INNER JOIN lessons ON lessons.lessonId=loans.lessonId
    INNER JOIN schools ON schools.schoolId=lessons.schoolId
    INNER JOIN books ON books.bookId=loans.bookId
    INNER JOIN publishers ON publishers.publisherId=books.publisherId
    ORDER BY schools.schoolName, loans.loanDate DESC, 1;
\end{verbatim}
\end{document}